package ShablonAnimal;

import Interface.CanDo;

public class Eagle extends Animal implements CanDo {
    public Eagle(int id, String name, int age, boolean domesticAnimal) {
        super(id, name, age, domesticAnimal);
    }
    public Eagle() {
        super();
    }
    @Override
    public void run() {
        System.out.println("Орнитологдордун бири бүркүттүн туурасы болжол менен 3,5 км, \n" +
                "болгон көлдү бир мүнөткө жетпеген убакытта кантип учуп өткөнүн байкаган. \n" +
                "Ошентип, бүркүттүн орточо учуу ылдамдыгы 190 км/саат болгон, \n" +
                "бул учуунун айрым бөлүктөрүндө ал 240 км/саатка жеткенин билдирет. \n" +
                "Жем издеп, бүркүт жерден 800м бийиктикке көтөрүлүп, 11,5 чарчы метр жерди ээлей алат. \n" +
                "Жемдигин байкаган бүркүт чукул айланып, канаттарын бекем бүктөп, болжол менен 320 км/саат ылдамдыкта чумкуйт!");
    }
    @Override
    public void whatDoesItEat() {
        System.out.println("Бүркүттөр эт жеген жаныбарлар, демек этти гана жешет. \n" +
                "Бүркүттөрдүн кээ бир түрлөрү жыйноочу болуп саналат, демек, \n" +
                "алар негизинен балыктарды жана өлгөн жаныбарларды жешет. \n" +
                "Бүркүттөр да олжосуна аңчылык кылышат, \n" +
                "бирок кээ бир түрлөрү башкаларга караганда көбүрөөк аңчылык кылышат.");
    }
    @Override
    public void whereDoesItLive() {
        System.out.println("Россиянын, Монголиянын, Казакстандын жана Кытайдын талааларында жана жарым чөлдөрүндө уя салышат. \n" +
                "Россияда Кавказдын тоо этектеринде, Түштүк Уралда, Алтайда жана Саянда, \n" +
                "Поволжье жана Забайкалье талааларында жашашат. \n" +
                "Сентябрдан марттын ортосуна чейин Талаа Бүркүттөрү жылуу климаттарга саякатташат.");
    }

    @Override
    public void fly() {
        System.out.println("Учуу");
    }
}
